Revit 2026 API

# LabelUtilsGetLabelForSpec Method

---

Gets the user-visible name for a spec.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetLabelForSpec(
	ForgeTypeId specTypeId
)
```
```vb
Public Shared Function GetLabelForSpec (
	specTypeId As ForgeTypeId
) As String
```
```cpp
public:
static String^ GetLabelForSpec(
	ForgeTypeId^ specTypeId
)
```
```fsharp
static member GetLabelForSpec :
        specTypeId : ForgeTypeId -> string
```

#### Parameters

specTypeId ForgeTypeId
     Identifier of the spec to get the user-visible name.

#### Return Value

String Returns the user-visible name for a spec.

| Exception | Condition |
| --- | --- |
| ArgumentException | The given identifier is neither a spec nor a category. |
| ArgumentNullException | A non-optional argument was null |

The name is obtained in the current Revit language. If the given identifier is a category, this method returns the name of the Family Type spec with that category, e.g. "Family Type: Walls".

#### Reference

LabelUtils Class

Autodesk.Revit.DB Namespace